# Parameter Type Id Projection Type Property

Source: https://www.revitapidocs.com/2026/df44f9c8-533e-937c-24b7-b65d2d32270e.htm

---

| Parameter Type Id Projection Type Property |
| --- |

"Projection Type"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ProjectionType { get; }
```

```
Public Shared ReadOnly Property ProjectionType As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ProjectionType {
	ForgeTypeId^ get ();
}
```

```
static member ProjectionType : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace